Tekla.Structures.Plugins.DirectManipulation.Services.Handles.DragEventArgs
Contains the event arguments for a drag event on a handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.DragEventArgs.Interrupted
Gets a value indicating whether the event arg was interrupted.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.DragEventArgs.StartPosition
Gets a point indicating the original position of the handle before the drag event.
Property returns middle point in case of LineHandler.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.DragEventArgs.DeltaTranslation
Gets a vector indicating the translation since the last drag event.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.DragEventArgs.TotalTranslation
Gets a vector indicating the total translation since the drag started.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.DragEventArgs.#ctor(System.Boolean,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Constructs an instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Handles.DragEventArgs class
interrupted: Determines if the event was interrupted.
startPosition: Drag original start position.
deltaTranslation: Drag translation since the last drag event.
totalTranslation: Total translation of the drag.